Revit 2027 API
PipeFlowState Enumeration
 An enumerated type listing all the pipe flow states for a pipe
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PipeFlowState
Public Enumeration PipeFlowState
public enum class PipeFlowState
type PipeFlowState
Members
Member name | Value | Description
LaminarState | 0 |  The flow state is Laminar
MultiValues | -1 |  The flow state has multi values
TransitionState | 1 |  The flow state is Transition
TurbulentState | 2 |  The flow state is Turbulent
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace